Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Perl allows multiple inheritance, which means that a class can inherit from multiple parents.
es: Perl permite la herencia múltiple: una clase puede heredar de múltiples clases primarias.

source: Perl already I<is> commercial software: it has a license that you can grab and carefully read to your manager.
es: Perl I<es> software comercial: tiene una licencia que su jefe puede analizar minuciosamente.

source: Perl also counts the underscore character as a valid letter.
es: Perl también admite el guión bajo como carácter válido.

source: Perl also defines a consistent extension syntax for features not found in standard tools like B<awk> and B<lex>.
es: Perl también define una sintaxis extendida coherente para características que no se encuentran en herramientas estándar, como B<awk> y B<lex>.

source: Perl also has its own built-in variables whose names don't follow these rules.
es: Perl también tiene sus propias variables predefinidas, cuyos nombres no siguen estas reglas.

source: Perl also lets you use a dereferenced scalar reference in a method call.
es: Perl también permite usar la desreferencia de una referencia escalar en la llamada a un método.

source: Perl also lets you use a scalar containing a string as a class name:
es: Perl también permite usar una variable escalar que contiene el nombre de una clase:

source: Perl backtracks when it attempts to match patterns with a L</regular expression>, and its earlier attempts don't pan out.
es: Perl vuelve atrás tras intentar detectar un patrón con una L</expresión regular> si los intentos realizados no logran detectarlo.

source: Perl builds and runs on a bewildering number of platforms.
es: Perl se puede compilar y ejecutar en una gran variedad de plataformas.

source: Perl by default is very forgiving.
es: Por su diseño, Perl es un lenguaje muy indulgente.

source: Perl can internally represent numbers in 3 different ways: as native integers, as native floating point numbers, and as decimal strings.
es: Perl puede representar los números internamente de 3 maneras distintas: como enteros nativos, como números de punto flotante nativos y como cadenas decimales.

source: Perl can use sophisticated pattern matching techniques to scan large amounts of data quickly.
es: Perl puede utilizar sofisticadas técnicas de detección de patrones para analizar rápidamente grandes cantidades de datos.

source: Perl combines (in the author's opinion, anyway) some of the best features of C, B<sed>, B<awk>, and B<sh>, so people familiar with those languages should have little difficulty with it.
es: Perl combina (en opinión del autor) algunas de las mejores características de C, B<sed>, B<awk> y B<sh>, por lo que las personas familiarizadas con estos lenguajes aprenderán Perl fácilmente

source: Perl comes with a wide selection of builtin functions.
es: Perl incluye una amplia selección de funciones y operadores predefinidos.

source: Perl converts between these automatically.
es: Perl realiza la conversión entre estas codificaciones automáticamente.

source: Perl defines the following zero-width assertions: X<zero-width assertion> X<assertion> X<regex, zero-width assertion> X<regexp, zero-width assertion> X<regular expression, zero-width assertion> X<\b> X<\B> X<\A> X<\Z> X<\z> X<\G>
es: Perl define las siguientes aserciones de ancho cero: X<zero-width assertion> X<assertion> X<regex, zero-width assertion> X<regexp, zero-width assertion> X<regular expression, zero-width assertion> X<\b> X<\B> X<\A> X<\Z> X<\z> X<\G> X<aserción ancho cero> X<aserción> X<regex, aserción ancho cero> X<regexp, aserción ancho cero> X<expresión regular, aserción ancho cero>

source: Perl does not need it.
es: Perl no lo necesita.

source: Perl does L</lexical scoping> of L<my|perlfunc/my> variables, meaning that the rest of the block can see the variable, but other subroutines called by the block I<cannot> see the variable.
es: Asimismo, Perl realiza L</control de ámbito léxico> de variables L<my|perlfunc/my>, lo que significa que el resto del bloque puede ver la variable, pero otras subrutinas llamadas por el bloque I<no> la pueden ver.

source: Perl does its numeric work with floating-point numbers (sometimes called "floats"), when it can't get away with using L<integers|/integer>.
es: Perl hace sus cálculos numéricos con números de punto flotante cuando no puede usar L<enteros|/entero> para ello.

source: Perl does not have any built-in way to express roles.
es: Perl no dispone de ningún mecanismo predefinido para expresar roles.

source: Perl does not provide any special syntax for class definitions.
es: Perl no proporciona una sintaxis especial para definir clases.

source: Perl does not provide any special syntax for defining a method.
es: Perl no proporciona ninguna sintaxis especial para la definición de métodos.

source: Perl does taint checks if you run a L</setuid> (or L</setgid>) program, or if you use the B<-T> switch.
es: Perl hace comprobaciones de seguridad si se ejecuta un programa L</setuid> (o L</setgid>), o si se usa el modificador B<-T>.

source: Perl doesn't match multiple characters in an inverted bracketed character class, which otherwise could be highly confusing.
es: Perl no detecta caracteres múltiples en una clase invertida de caracteres entre corchetes (si lo hiciera podría ser muy confuso).

source: Perl doesn't really have header files, though historically Perl has sometimes used translated I<.h> files with a I<.ph> extension.
es: En realidad Perl no tiene archivos de encabezado, pero históricamente ha utilizado a veces archivos I<.h> traducidos con una extensión I<.ph>.

source: Perl doesn't.
es: Perl no.

source: Perl handles pointers internally so you don't have to worry about them.
es: Perl controla los punteros internamente para que no tengamos que preocuparnos de ello.

source: Perl has a built-in L<grep|perlfunc/grep> function that searches a list for elements matching any given criterion, whereas the I<grep>(1) program searches for lines matching a L</regular expression> in one or more files.
es: Perl incluye una función L<grep|perlfunc/grep> predefinida que permite buscar en una lista los elementos que cumplan algún criterio especificado, a diferencia del programa I<grep>(1), que busca líneas que coincidan con una L</expresión regular> en uno o varios archivos.

source: Perl has an B<internal format>, an encoding that it uses to encode text strings so it can store them in memory.
es: Perl utiliza un B<formato interno>, que es una codificación con la que se codifican las cadenas de texto para almacenarlas en memoria.

source: Perl has an abstracted interface for all supported character encodings, so this is actually a generic C<Encode> tutorial and C<Encode> FAQ.
es: Perl incluye una interfaz que abstrae todas las codificaciones de caracteres compatibles; este documento es en realidad un tutorial genérico de C<Encode> con las preguntas más frecuentes sobre C<Encode>.

source: Perl has both numeric and string relational operators.
es: Perl tiene operadores relaciones numéricos y de cadena.

source: Perl has most of the usual conditional and looping constructs.
es: Perl ofrece las estructuras condiciones y de bucle habituales.

source: Perl has no special syntax for attributes.
es: Perl no dispone de una sintaxis especial para los atributos.

source: Perl has three built-in data types: scalars, arrays of scalars, and associative arrays of scalars, known as "hashes".
es: Perl tiene tres tipos de datos predefinidos: escalares, arrays de escalares y arrays asociativos de escalares (denominados "hashes").

source: Perl has three main variable types: scalars, arrays, and hashes.
es: En Perl hay tres tipos de variables principales: escalares, arrays y hashes.

source: Perl has two major annual conventions: The Perl Conference (now part of OSCON), put on by O'Reilly, and Yet Another Perl Conference or YAPC (pronounced yap-see), which is localized into several regional YAPCs (North America, Europe, Asia) in a stunning grassroots display by the Perl community.
es: Hay dos importantes congresos anuales sobre Perl: la Conferencia Perl (que ahora forma parte de OSCON), organizada por O'Reilly, y la YAPC (pronunciado yap-si, que significa Yet Another Perl Conference), que se celebra en varias conferencias YAPC regionales (Norteamérica, Europa, Asia) y constituye una impresionante demostración de la comunidad Perl.

source: Perl hides the file descriptor inside a L</standard IE<sol>O> stream and then attaches the stream to a L</filehandle>.
es: Perl oculta el descriptor de archivo dentro de una secuencia de L</EE<sol>S estándar> y asocia la secuencia a un L</identificador de archivo>.

source: Perl history in brief, by Larry Wall:
es: Resumen de la historia de Perl, por Larry Wall:

source: Perl informally reserves lowercase module names for "pragma" modules like C<integer> and C<strict>.
es: De manera informal, Perl reserva los nombres de módulo en minúsculas para los módulos de tipo "pragma", como C<integer> y C<strict>.

source: Perl is a contextually polymorphic language whose scalars can be strings, numbers, or references (which includes objects).
es: Perl es un lenguaje contextualmente polimórfico, cuyos escalares pueden ser cadenas, números o referencias (entre las que se incluyen los objetos).

source: Perl is a general-purpose programming language originally developed for text manipulation and now used for a wide range of tasks including system administration, web development, network programming, GUI development, and more.
es: Perl es un lenguaje de programación de propósito general desarrollado originalmente para la manipulación de texto y que, en la actualidad, se usa para una amplia gama de tareas, como administración de sistemas, desarrollo web, programación de red, desarrollo de interfaces gráficas de usuario, etc.

source: Perl is a high-level programming language with an eclectic heritage written by Larry Wall and a cast of thousands.
es: Perl es un lenguaje de programación de alto nivel con una herencia ecléctica, creado por Larry Wall con la ayuda de miles de programadores.

source: Perl is at the mercy of your machine's definitions of various operations such as type casting, atof(), and floating-point output with sprintf().
es: Perl depende de las definiciones de hardware para diversas operaciones, como la conversión de tipos, atof() o la salida de números de punto flotante con sprintf().

source: Perl is available for most operating systems, including virtually all Unix-like platforms.
es: Perl está disponible para la mayoría de los sistemas operativos (incluidas prácticamente todas las plataformas Unix).

source: Perl is copyrighted and is thus I<not> in the public domain--it's just L</freely available> and L</freely redistributable>.
es: Perl está protegido por derechos de autor y, por consiguiente, I<no es> de dominio público, simplemente está L</disponible gratuitamente> y es L</redistribuible gratuitamente>.

source: Perl is designed to give you several ways to do anything, so consider picking the most readable one.
es: Perl se diseñó para ofrecer varias maneras de hacer casi todo; seguramente le interese elegir la más legible.

source: Perl is flexible and extensible enough for you to use on virtually any task, from one-line file-processing tasks to large, elaborate systems.
es: Por su flexibilidad y capacidad de ampliación, Perl se puede usar prácticamente para cualquier tarea, desde el procesamiento de archivos en una línea hasta el desarrollo de sistemas grandes y complejos.

source: Perl is much more portable across operating systems than many other languages.
es: Perl es mucho más adaptable de un sistema operativo a otro que muchos lenguajes.

source: Perl is not currently able to do this when the multiple characters are in the pattern and are split between groupings, or when one or more are quantified.
es: Actualmente, Perl no es capaz de hacer esto cuando las secuencias de caracteres están en el patrón y se dividen en agrupaciones, o cuando se usa un cuantificador en uno o varios de estos caracteres.

source: Perl is not produced nor maintained by the Free Software Foundation.
es: La Free Software Foundation no tiene nada que ver con el desarrollo y el mantenimiento de Perl.

source: Perl is not strictly a shell because it's not interactive (although Perl programs can be interactive).
es: En sentido estricto, Perl no es una shell porque no es interactivo, aunque los programas Perl pueden ser interactivos.

source: Perl is sort of a machine shop.
es: Perl es una especie de taller de maquinaria.

source: Perl is supported by its users.
es: El soporte de Perl lo ofrecen sus usuarios.

source: Perl is written in C, so it's not surprising that Perl borrowed a few ideas from it.
es: Perl está escrito en C, por lo que no es sorprendente que haya heredado muchas ideas de C.

source: Perl keeps a separate line number for each source or input file it opens.
es: Perl mantiene un número de línea independiente para cada archivo de origen o de entrada que abre.

source: Perl knows how it stored the string internally, and will use that knowledge when you C<encode>.
es: Perl sabe cómo se ha almacenado la cadena internamente, y usará ese conocimiento al codificar.

source: Perl knows what package the method is in by looking at the left side of the arrow.
es: Perl mira lo que hay a la izquierda del operador flecha para determinar a qué paquete pertenece el método.

source: Perl lets you use a scalar variable containing a string as a method name:
es: Perl permite usar como nombre de un método una variable escalar que contiene una cadena:

source: Perl limits barewords (like identifiers) to about 250 characters.
es: Perl limita la longitud de las palabras sueltas a cerca de 250 caracteres (igual que los identificadores).

source: Perl manages this transparently for you, for the most part.
es: Por lo general, Perl se encargará de esto automáticamente.

source: Perl modules always have a F<.pm> file, but there may also be dynamically linked executables (often ending in F<.so>) or autoloaded subroutine definitions (often ending in F<.al>) associated with the module.
es: Los módulos Perl siempre tienen un archivo F<.pm>, pero podrían tener asociados otros ejecutables vinculados dinámicamente (normalmente con la extensión F<.so>) o definiciones de subrutinas cargadas automáticamente (normalmente con extensión F<.al>).

source: Perl modules are included into your program by saying
es: Para incluir un módulo Perl en un programa, escriba

source: Perl modules included on CPAN have a naming hierarchy you should try to fit in with.
es: Los módulos Perl incluidos en CPAN tienen una jerarquía de nomenclatura; procure respetarla.

source: Perl modules provide a range of features to help you avoid reinventing the wheel, and can be downloaded from CPAN ( http://www.cpan.org/ ).
es: No pierda tiempo reinventando la rueda. Los módulos de Perl disponibles en CPAN ( http://www.cpan.org/) proporcionan funcionalidad que puede utilizar en sus programas.

source: Perl officially stands for Practical Extraction and Report Language, except when it doesn't.
es: Oficialmente, Perl significa Practical Extraction and Report Language (I<Lenguaje práctico para la extracción de datos y creación de informes>), salvo cuando no se usa para eso.

source: Perl only supports single-byte locales.
es: Perl solo admite configuraciones regionales de byte único.

source: Perl operations which take a numeric argument treat that argument in one of four different ways: they may force it to one of the integer/floating/ string formats, or they may behave differently depending on the format of the operand.
es: En Perl, las operaciones que consumen un argumento numérico tratan al argumento de una de cuatro maneras posibles: pueden forzar la conversión a uno de los formatos de entero/número de punto flotante/cadena, o pueden comportarse de una manera diferente en función del formato del operando.

source: Perl operators are documented in full in L<perlop>, but here are a few of the most common ones:
es: Encontrará información detallada sobre los operadores de Perl en L<perlop>; algunos de los más comunes son:

source: Perl packages may be nested inside other package names, so we can have package names containing C<::>.
es: Los paquetes Perl pueden anidarse dentro de otros nombres de paquete, por lo que los nombres de paquete pueden contener C<::>.

source: Perl programs don't usually need a L</Makefile> because the Perl compiler has plenty of self-control.
es: En general, los programas Perl no necesitan un archivo L</Makefile> porque el compilador de Perl destaca por su autocontrol.

source: Perl provides a mechanism for alternative namespaces to protect packages from stomping on each other's variables.
es: Perl proporciona un mecanismo de espacios de nombres alternativos que evita colisiones entre variables de distintos paquetes.

source: Perl provides a set of asbestos gloves for handling all memory management.
es: Perl proporciona un conjunto de guantes de asbesto para controlar toda la administración de memoria.

source: Perl refers to the error by the name C<$!> (or C<$OS_ERROR> if you use the English module).
es: Perl usa la variable C<$!> (o bien C<$OS_ERROR>, si usa el módulo English) para hacer referencia a este error.

source: Perl regexps also support backreferences, lookaheads, and all kinds of other complex details.
es: Las expresiones regulares de Perl también ofrecen referencias a capturas previas, inspección hacia adelante, y muchas otras funcionalidades complejas.

source: Perl remains fundamentally a dynamically typed language, not a statically typed one.
es: En esencia, Perl es un lenguaje de tipos dinámicos, no de tipos estáticos.

source: Perl resolves this ambiguity by interpreting C as a backreference only if at least 10 left parentheses have opened before it.
es: Perl resuelve esta ambigüedad interpretando C como una retrorreferencia si antes hay, como mínimo, 10 paréntesis de apertura.

source: Perl runs on e-mail; there is no doubt about it.
es: No cabe duda de que el desarrollo de Perl se basa en gran medida en el correo electrónico.

source: Perl statements end in a semi-colon:
es: Las instrucciones de Perl deben terminar con un signo de punto y coma:

source: Perl suports another method invocation syntax called "indirect object" notation.
es: Perl admite otra sintaxis para las llamadas a métodos, denominada notación "indirecta de objeto".

source: Perl supplies no such restriction, though you may certainly program Perl that way if you like.
es: Perl no impone esta restricción, pero si lo desea puede programar Perl de esta manera.

source: Perl supports several other ways to call methods besides the C<< $object->method() >> usage we've seen so far.
es: Perl admite varias formas de llamar a los métodos, además de la que ya hemos usado, C<< $objeto->metodo() >>.

source: Perl thinks that some of the things people try to do are devoid of meaning, in particular, making use of variables that have never been given a L</value> and performing certain operations on data that isn't there.
es: Perl piensa que algunas de las cosas que las personas intentan hacer no tienen sentido, como usar variables a las que nunca se ha asignado un L</valor> o realizar determinadas operaciones con datos que no existen.

source: Perl tries to be all things to all people, but nothing special to anyone.
es: Perl trata de cubrir todas las necesidades, en lugar de limitarse a fines específicos.

source: Perl uses an internal type called a I<typeglob> to hold an entire symbol table entry.
es: Perl utiliza un tipo interno denominado I<typeglob> para mantener una entrada completa en la tabla de símbolos.

source: Perl uses the C<-f> file test operator to identify regular files.
es: Perl usa la prueba de archivo C<-f> para identificar archivos normales.

source: Perl was originally a language optimized for scanning arbitrary text files, extracting information from those text files, and printing reports based on that information.
es: Perl se creó como un lenguaje optimizado para procesar archivos de texto, a fin de extraer información y utilizarla para generar informes.

source: Perl websites come in a variety of forms, but they fit into two large categories: forums and news websites.
es: Los sitios web sobre Perl son de diversos tipos, pero se engloban en dos grandes categorías: foros y sitios de noticias.

source: Perl will always interpret this as a method call.
es: Perl siempre interpretará esto como una llamada a un método.

source: Perl workshops are, as the name might suggest, workshops where Perl is taught in a variety of ways.
es: Los talleres ("workshops") de Perl son, como su nombre indica, eventos en los que se enseña Perl de varias maneras.

source: Perl's learning curve is therefore shallow (easy to learn) and long (there's a whole lot you can do if you really want).
es: Así, la curva de aprendizaje de Perl tiene una pendiente suave (es fácil de aprender) y larga (si desea seguir profundizando, puede aprender a hacer muchas cosas).

source: Perl's OO system is class-based.
es: El sistema de orientación a objetos de Perl se basa en clases.

source: Perl's built-in introspection features are fairly minimal.
es: Las características de introspección predefinidas son mínimas.

source: Perl's licensing terms are also more open than GNU software's tend to be.
es: Los términos de la licencia de Perl también son más flexibles en general que los de las licencias de software GNU.

source: Perl's operator overloading facility is completely ignored here.
es: Se omite completamente la funcionalidad de sobrecarga de operadores de Perl,

source: Perl's process, file, and text manipulation facilities make it particularly well-suited for tasks involving quick prototyping, system utilities, software tools, system management tasks, database access, graphical programming, networking, and world wide web programming.
es: Las características de manipulación de texto, archivos y procesos que ofrece Perl lo convierten en un lenguaje especialmente adecuado para tareas que requieren crear rápidamente prototipos, utilidades del sistema, herramientas de software, tareas de administración de sistemas, acceso a bases de datos, programación gráfica, conexión a redes y programación web.

source: Perl's regular expression support is both broad and deep, and is the subject of lengthy documentation in L<perlrequick>, L<perlretut>, and elsewhere.
es: El soporte de Perl para las expresiones regulares es amplio y profundo, y se describe en gran detalle en los documentos L<perlrequick> y L<perlretut>, entre otros.

source: Perl's regular expressions are far from regular in the theoretical sense, but in regular use they work quite well.
es: Las expresiones regulares de Perl no son regulares en un sentido teórico, pero su uso regular produce muy buenos resultados.

source: PerlMonks is one of the largest Perl forums, and describes itself as "A place for individuals to polish, improve, and showcase their Perl skills." and "A community which allows everyone to grow and learn from each other."
es: PerlMonks es uno de los mayores foros de Perl, y se describe como "Un lugar que permite a los individuos pulir, mejorar y demostrar sus conocimientos de Perl" o como "Una comunidad que ayuda a que todos mejoren y aprendan unos de otros".

source: Perl_mro_register(aTHX_ &my_mro_alg);
es: Perl_mro_register(aTHX_ &mi_alg_mro);

source: Perl_mro_set_private_data(aTHX_ meta, &c3_alg, private_sv);
es: Perl_mro_set_private_data(aTHX_ meta, &alg_c3, private_sv);
